Catalogs/Столы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Столы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтола</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСтолов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Столы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьНаименование()

	Если ЗначениеЗаполнено(Объект.ТипСтола) Тогда
		Возврат Шаблон("[ТипСтола] № [Номер]", 
			Новый Структура("ТипСтола,Номер", Объект.ТипСтола, Объект.Код));
	КонецЕсли; 
	
	Возврат "№ " + Объект.Код; 
		
КонецФункции // ПолучитьНаименование()

&НаСервере
Функция ПолучитьНаименованиеСервер()
	
	Возврат Справочники.Столы.ПолучитьНаименование(Объект);
		
КонецФункции // ПолучитьНаименованиеСервер()


&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	// Наследуемые реквизиты.
	РодительПриИзмененииСервер();
	
	// Автоматическое формирование наименования.
	ТипСтолаПриИзменении(Неопределено);

КонецПроцедуры // РодительПриИзменении()

&НаСервере
Процедура РодительПриИзмененииСервер()
	
	__РаботаСДаннымиКлиентСервер.ПолучитьНаследуемыеРеквизиты(Объект);

	Объект.ТипСтола = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
							Объект.Родитель.ТипСтола,
							Объект.ТипСтола);

КонецПроцедуры // РодительПриИзмененииСервер()

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // КодПриИзменении()

&НаКлиенте
Процедура ТипСтолаПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // ТипСтолаПриИзменении()

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // НаименованиеПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Данные.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);	
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименованиеСервер(), Элементы.Наименование);

КонецПроцедуры // ПриЧтенииНаСервере()
